export const WARN_CODE = {
    e0: { msg: "门锁未关好", switch: false,text:"请检查门锁是否关紧，或尝试重新关门。" },
    e1: { msg: "电池电量不足", switch: false,text:"请确认门锁电池型号，购买指定型号电池并尽快更换 如有疑问，可致电客服。" },
    e2: { msg: "密码错误次数超限", switch: true,text:"由于密码错误超过次数限制，已锁定，请确认您的正确密码，1分钟后再试。" },
    e3: { msg: "有人强行拆门锁", switch: false,text:"请确认门锁面板是否被异常拆除，如无异常可关闭告警提示。" },
    e4: { msg: "家人被挟持", switch: false,text:"家人触发了门锁上被挟持指纹报警，请尽快确认家人安全，并选择报警，如果是误操作可关闭告警提示。" },
    e5: { msg: "门锁被锁死", switch: true,text:"由于密码或者指纹多次输入错误，门锁已禁止任何方式开门，请等待解锁后再尝试开门。" },
    e6: { msg: "门锁被反锁", switch: true,text:"如门锁已被反锁，无法手机开锁。请检查门锁并解除反锁，再尝试通过APP操作。" },
    e7: { msg: "密码错误次数超限", switch: true,text:"由于密码错误超过次数限制，无法通过APP开锁，请尝试用其他方式开锁，或致电客服。" }
};

export const OPEN_TYPE = {
    "17": "密码开锁",
    "18": "指纹开锁",
    "19": "IC卡开锁",
    "20": "钥匙开门",
    "21": "手机App开锁"
};
